In [6]:
import pandas as pd
import numpy as np

In [104]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela']) 
print(df['edad'] >= 12)

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [106]:
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

In [107]:
df.drop(columns=['edad'])

           cm pais genero    Q1   Q2
ana       115   co      M   5.0  7.0
benito    110   mx      F  10.0  9.0
camilo    130   co      F   8.0  9.0
daniel    155   mx      M   NaN  8.0
erika     125   mx      M   7.0  8.0
fabian    120   ch      M   8.0  8.0
gabriela  125   ch      F   3.0  9.0

In [78]:
a = df.convert_dtypes()
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, ana to gabriela
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   edad    7 non-null      Int64
 1   cm      7 non-null      Int64
 2   pais    7 non-null      string
 3   genero  7 non-null      string
 4   Q1      6 non-null      Int64
 5   Q2      7 non-null      Int64
dtypes: Int64(4), string(2)
memory usage: 420.0+ bytes

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, ana to gabriela
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   edad    7 non-null      int64
 1   cm      7 non-null      int64
 2   pais    7 non-null      object
 3   genero  7 non-null      object
 4   Q1      6 non-null      float64
 5   Q2      7 non-null      float64
dtypes: float64(2), int64(2), object(2)
memory usage: 392.0+ bytes

In [15]:
df2 = df
df2

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

In [18]:
df3 = df2[['pais']].astype('category')
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, ana to gabriela
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pais    7 non-null      category
dtypes: category(1)
memory usage: 487.0+ bytes

In [20]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela']) 
print(df.iloc[[4],[2]])

      pais
erika   mx

In [21]:
df.to_csv('./db/ex1.csv',sep='|',index=False)

In [24]:
np.array([10,8,5,0]) * np.array([0,1,6,12])

array([ 0,  8, 30,  0])

In [25]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela']) 
print(df.loc[['ana'],['cm']])

      cm
ana  115

In [31]:
p1 = {'a' : [1,2,3,4,5],
      'b' : [6,7,8,9,10]}
d1 = pd.DataFrame(p1)
p2 = {'a' : [1,2,3,4,5],
      'b' : [6,7,8,9,10]}
d2 = pd.DataFrame(p2)

In [102]:
pd.concat([d1,d2])

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [55]:
d1.append(d2)

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [61]:
d1.describe(include='all')

              a          b
count  5.000000   5.000000
mean   3.000000   8.000000
std    1.581139   1.581139
min    1.000000   6.000000
25%    2.000000   7.000000
50%    3.000000   8.000000
75%    4.000000   9.000000
max    5.000000  10.000000

In [35]:
df.dtypes

edad        int64
cm          int64
pais       object
genero     object
Q1        float64
Q2        float64
dtype: object

In [36]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12, 13], 'cm' : [ 115, 110, 130, 155, 125, 120, 125, 130], 'pais' : [ 'mx', 'mx', 'co', 'mx', 'mx', 'co', 'co', 'co'], 'genero' : [ 'F', 'M', 'M', 'M', 'F', 'M', 'F', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3, 2], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9, 8] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela', 'marta']) 
#¿Cuál sería la expresión para obtener la altura promedio y la suma agrupando por género?

In [37]:
df

          edad   cm pais genero    Q1  Q2
ana         10  115   mx      F   5.0   7
benito       9  110   mx      M  10.0   9
camilo      13  130   co      M   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      F   7.0   8
fabian      11  120   co      M   8.0   8
gabriela    12  125   co      F   3.0   9
marta       13  130   co      F   2.0   8

In [38]:
df.groupby(['genero','pais'])['cm'].agg([np.median,np.std])

             median        std
genero pais
F      co     127.5   3.535534
       mx     120.0   7.071068
M      co     125.0   7.071068
       mx     132.5  31.819805

In [40]:
[10,8,5,0] + [0,1,6,12]

[10, 8, 5, 0, 0, 1, 6, 12]

In [114]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
# ¿Cuál es la edad promedio de las mujeres?

In [117]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])

In [118]:
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

In [121]:
df.groupby(['genero']).agg([np.mean])

             edad          cm        Q1    Q2
             mean        mean      mean  mean
genero
F       11.333333  121.666667  7.000000  9.00
M       11.750000  128.750000  6.666667  7.75

In [50]:
(5+7+8)/3

6.666666666666667

In [62]:
pd.NA | False

In [63]:
df.shape

(7, 6)

In [113]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela']) 
print(df.query("(edad >= 12) & (cm < 130) & (Q1 > 5)")['Q2'])

erika    8.0
Name: Q2, dtype: float64

In [69]:
pd.Series([10,8,5,0]) - pd.Series([0,1,6,12])

0    10
1     7
2    -1
3   -12
dtype: int64

In [92]:
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

In [97]:
df.dtypes

edad        int64
cm          int64
pais       object
genero     object
Q1        float64
Q2        float64
dtype: object

In [99]:
df.convert_dtypes()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, ana to gabriela
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   edad    7 non-null      Int64
 1   cm      7 non-null      Int64
 2   pais    7 non-null      string
 3   genero  7 non-null      string
 4   Q1      6 non-null      Int64
 5   Q2      7 non-null      Int64
dtypes: Int64(4), string(2)
memory usage: 420.0+ bytes

In [87]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])

In [88]:
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

In [89]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela']) 
print(df['edad'] >= 12)

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [85]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela']) 
print(df.query("(edad >= 12) & (cm < 130) & (Q1 > 5)")['Q2'])

erika    8.0
Name: Q2, dtype: float64

In [90]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela']) 
print(df['edad'] >= 12)

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [110]:
df = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 'cm' : [ 115, 110, 130, 155, 125, 120, 125], 'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 'genero' : [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'], 'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela']) 
#¿Cuáles son los estudiantes mayores de 12 años y de nacionalidad mexicana?

In [111]:
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

In [112]:
df[(df['edad']>12)&(df['pais'] == 'mx')]

        edad   cm pais genero  Q1   Q2
daniel    14  155   mx      M NaN  8.0